pages/2_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ESafety2</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">ESafety2</h1>
  <div class="github-fork-ribbon-wrapper left">
    <div class="github-fork-ribbon">
      <a href="https://github.com/MarcScott/7-CS-ESafety">Fork me on GitHub</a>
    </div>
  </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>
<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1">Social Engineering</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Social engineering is the art of manipulating people so that you tell them your personal information.
</li>
<li>Criminals are usually trying to fool you into giving them your passwords, bank information, or access your computer to secretly install malicious software which gives them access to your passwords, bank information and control over your computer.
</li>
<li>Criminals use social engineering tactics because it is usually easier to exploit your natural inclination to trust than it is to discover ways to hack your software.  
</li>
<li>For example, it is much easier to fool someone into giving you their password than it is for you to try hacking their password (unless the password is really weak).
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3 try">
<h3 id="sec-1-2">Try It</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<b>Answer the following questions in a text editor such as Word:</b>
</p>
<ul class="org-ul">
<li>How good is your current password? Firstly, is it in the most common passwords <a href="http://www.telegraph.co.uk/technology/2016/01/26/most-common-passwords-revealed---and-theyre-ridiculously-easy-to/">here</a>?
</li>
<li>Secondly, test the strength of your password by using the online password <a href="https://howsecureismypassword.net">checker.</a>
</li>
<li>Write down how long it would take to break. 
</li>
<li>Now we are going to try to improve that by reading the above article and watching the video below:
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/t8SQo3R7qeU" frameborder="0" allowfullscreen></iframe>
<ul class="org-ul">
<li>What does the article/ video/online checker suggest we do to make our passwords stronger? 
</li>
<li>What in the future are we going to replace passwords with?
</li>
<li>What five tips would you give to someone to making a new secure password? Write them down!
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 document">
<h3 id="sec-1-3">Document It</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>In your document say how you have improved your password security i.e how long did it take to break at the start and now with your new password. 
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 research">
<h3 id="sec-1-4">Research It</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>We have improved our password, at this point feel free to change your network password, now  we need to protect it from us!
</li>
<li>Look for examples of people being tricked. This article is a good <a href="http://www.darkreading.com/the-7-best-social-engineering-attacks-ever/d/d-id/1319411">starting</a> point.
</li>
<li>The video on this <a href="http://www.phonearena.com/news/Watch-as-people-are-tricked-into-giving-up-their-passwords_id64905">page</a> is good too!
</li>
<li>Think of tips to help us not being deceived into giving out of details.
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Badge It - Silver</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>You should already have answered the above questions in full sentences which shows your strength of password at the start of the lesson and then new stronger version. 
</li>
<li>You should have written a 'top 5 tips' on choosing a password.
</li>
<li>Finally from reading the two articles, including the video, write a sentence or two on how to avoid being tricked.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2 activity">
<h2 id="sec-2">Malware and Security</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-sec-2-1" class="outline-3 learn">
<h3 id="sec-2-1">Learn It</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Malware is any type of software that is designed to do harm to your computer.
</li>
<li>These might be viruses, adware, spyware, trojan horses, ransomware, scareware or worms.
</li>
<li>Viruses are programs that embed themselves in some other software (including the operating system) on the target system without the user's consent and when that is run causes the virus to spread.    
</li>
<li>Adware is a software that downloads or displays unwanted ads when a user is online, collects marketing data and other information without the user's knowledge or redirects search requests to certain advertising websites. 
</li>
<li>Spyware is a program that  do not spread like viruses; instead they are installed by exploiting security holes. They can also be hidden and packaged together with installed software.
</li>
<li>Trojans are any malicious computer programs which misrepresents itself to appear useful, routine, or interesting in order to persuade a victim to install it. 
</li>
<li>Worms are stand-alone malware programs that actively transmit themselves over a network to infect other computers.
</li>
<li>Ransomware affects an infected computer in some way, and demands payment to reverse the damage.
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/uJRqZTNMCMo" frameborder="0" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3 badge">
<h3 id="sec-2-2">Badge It - Gold</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>Adding to your written notes to be uploaded, answer the following questions: 
</li>
<li>How do you remove these malicious software programs?
</li>
<li>Prevention is better than cure - give me five tips for avoiding them.
</li>
<li>Find three antivirus programs. Make sure at least one is free and one is paid for.
</li>
<li>What are the differences? 
</li>
<li>What would you recommend?
</li>
<li>Finally, What’s a firewall?  
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2 activity">
<h2 id="sec-3">Responsible Internet Use</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-sec-3-1" class="outline-3 learn">
<h3 id="sec-3-1">Learn It</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<b>File sharing</b>
</p>
<ul class="org-ul">
<li>There are piracy laws protecting the distribution of films and other media. It is illegal to rip a copyrighted DVD or CD and distribute it online. However, peer-to-peer (P2P) file-sharing networks and hosting websites mean it is easy to share files with anyone in the world.
</li>
<li>At which point does sharing a film with others become piracy?
</li>
</ul>

<p>
<b>Software piracy</b>
</p>
<ul class="org-ul">
<li>Software piracy is any attempt to break the licence terms of a piece of software. This includes downloading and using a program without paying for it, as well as buying, selling or giving away illegitimate copies of a game or any other piece of software. It could mean extracting code from a program, or modifying it without permission in order to do something that the developers did not wish you to do.
</li>
<li>When you buy software, music or films legally, copyright law forbids you from:
<ul class="org-ul">
<li>giving a copy to a friend
</li>
<li>making a copy and then selling it
</li>
<li>using the software on a network (unless the licence allows it, eg it is a business licence)
</li>
<li>renting the software without the permission of the copyright holder
</li>
<li>The practice of copying software is a serious problem in some countries. Copying music, films and software illegally means that there is less money available to pay the writers, developers and artists.
</li>
<li>Some people argue that the incentive to produce new songs, films, television shows and games disappears as a result of piracy.
</li>
</ul>
</li>
</ul>

<p>
<b>Privacy</b>
</p>
<ul class="org-ul">
<li>What information can we consider to be private and who owns data? For example, photographs that are uploaded to social networks often legally become the property of the website.
</li>
<li>At what stage can private information like this be used and for what purposes?
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3 test">
<h3 id="sec-3-2">Test It</h3>
<div class="outline-text-3" id="text-3-2">

<p>
<a href="http://www.bbc.co.uk/bitesize/quiz/q81836819">http://www.bbc.co.uk/bitesize/quiz/q81836819</a>
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3 badge">
<h3 id="sec-3-3">Badge It - Platinum</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>You have been tasked with coming up with advice for Year 7s. Make a fun document, poster or presentation, that could be given to students to inform them of how to be reponsible online.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
